## Plan Result (ptl_finops_reporting - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.finopslogicapp-la-hmctsprod[0]
* Update
  * azurerm_logic_app_workflow.finopslogicapp[0]
* Delete
  * azurerm_role_assignment.finopslogicapp-la[0]
* Move
  * azurerm_role_assignment.finopslogicapp-sa[0] => azurerm_role_assignment.finopslogicapp-sa
  * azurerm_user_assigned_identity.finopslogicapp-mi[0] => azurerm_user_assigned_identity.finopslogicapp-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.finopslogicapp[0] will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "finopslogicapp" {
        id                                 = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Logic/workflows/finopsdataptllogicapp"
        name                               = "finopsdataptllogicapp"
      ~ parameters                         = {
          - "$connections" = jsonencode(
                {
                  - azureblob        = {
                      - connectionId         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Web/connections/azureblob"
                      - connectionName       = "azureblob"
                      - connectionProperties = {
                          - authentication = {
                              - identity = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-ptl-mi"
                              - type     = "ManagedServiceIdentity"
                            }
                        }
                      - id                   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/azureblob"
                    }
                  - azuremonitorlogs = {
                      - connectionId         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Web/connections/azuremonitorlogs"
                      - connectionName       = "azuremonitorlogs"
                      - connectionProperties = {
                          - authentication = {
                              - identity = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-ptl-mi"
                              - type     = "ManagedServiceIdentity"
                            }
                        }
                      - id                   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/azuremonitorlogs"
                    }
                }
            ) -> null
        }
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting"
            "businessArea" = "CFT"
          + "criticality"  = "High"
            "environment"  = "production"
          + "startupMode"  = "always"
        }
      ~ workflow_parameters                = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.finopslogicapp-la[0] will be destroyed
  # (because azurerm_role_assignment.finopslogicapp-la is not in configuration)
  - resource "azurerm_role_assignment" "finopslogicapp-la" {
      - id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod/providers/Microsoft.Authorization/roleAssignments/43d4123a-3f8d-d3a8-022b-684f21d01ac0" -> null
      - name                                   = "43d4123a-3f8d-d3a8-022b-684f21d01ac0" -> null
      - principal_id                           = "597b4d17-2d84-4c6d-8806-c55e1a5c6f18" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/73c42c96-874c-492b-b04d-ab87d138a893" -> null
      - role_definition_name                   = "Log Analytics Reader" -> null
      - scope                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.finopslogicapp-la-hmctsprod[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-la-hmctsprod" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "597b4d17-2d84-4c6d-8806-c55e1a5c6f18"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.finopslogicapp-sa[0] has moved to azurerm_role_assignment.finopslogicapp-sa
    resource "azurerm_role_assignment" "finopslogicapp-sa" {
        id                                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Storage/storageAccounts/finopsdataptlsa/providers/Microsoft.Authorization/roleAssignments/b07fe610-5822-8901-e745-2c73cdf990ec"
        name                                   = "b07fe610-5822-8901-e745-2c73cdf990ec"
        # (9 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.finopslogicapp-mi[0] has moved to azurerm_user_assigned_identity.finopslogicapp-mi
    resource "azurerm_user_assigned_identity" "finopslogicapp-mi" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-ptl-mi"
        name                = "finopslogicapp-ptl-mi"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"ptl_finops_reporting - TerraformPlanApply","Vars":{}} -->